; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite4 - satellite
	instrument10 - instrument
	instrument11 - instrument
	satellite5 - satellite
	instrument12 - instrument
	instrument13 - instrument
	instrument14 - instrument
	image1 - mode
	infrared4 - mode
	image0 - mode
	thermograph2 - mode
	spectrograph3 - mode
	GroundStation2 - direction
	Star3 - direction
	GroundStation4 - direction
	GroundStation1 - direction
	GroundStation0 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Planet9 - direction
)
(:init
	(supports instrument0 spectrograph3)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 thermograph2)
	(supports instrument1 image0)
	(supports instrument1 infrared4)
	(calibration_target instrument1 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon7)
	(supports instrument2 image1)
	(supports instrument2 thermograph2)
	(supports instrument2 spectrograph3)
	(calibration_target instrument2 GroundStation4)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 GroundStation1)
	(supports instrument4 thermograph2)
	(supports instrument4 spectrograph3)
	(calibration_target instrument4 GroundStation2)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation1)
	(supports instrument5 image0)
	(calibration_target instrument5 Star3)
	(supports instrument6 infrared4)
	(calibration_target instrument6 GroundStation0)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon5)
	(supports instrument7 image0)
	(supports instrument7 infrared4)
	(calibration_target instrument7 Star3)
	(supports instrument8 spectrograph3)
	(supports instrument8 image1)
	(calibration_target instrument8 GroundStation2)
	(supports instrument9 spectrograph3)
	(calibration_target instrument9 GroundStation0)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star3)
	(supports instrument10 infrared4)
	(calibration_target instrument10 Star3)
	(supports instrument11 image1)
	(calibration_target instrument11 Star3)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation2)
	(supports instrument12 thermograph2)
	(supports instrument12 image1)
	(calibration_target instrument12 GroundStation4)
	(supports instrument13 spectrograph3)
	(supports instrument13 image0)
	(supports instrument13 infrared4)
	(calibration_target instrument13 GroundStation1)
	(supports instrument14 infrared4)
	(calibration_target instrument14 GroundStation0)
	(on_board instrument12 satellite5)
	(on_board instrument13 satellite5)
	(on_board instrument14 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Phenomenon7)
)
(:goal (and
	(pointing satellite0 Phenomenon5)
	(pointing satellite3 GroundStation1)
	(pointing satellite4 Phenomenon6)
	(have_image Phenomenon5 infrared4)
	(have_image Phenomenon6 infrared4)
	(have_image Phenomenon7 infrared4)
	(have_image Phenomenon8 image0)
	(have_image Planet9 spectrograph3)
))

)

; plan
1. (turn_to satellite5 groundstation1 phenomenon7)
   deleted: (pointing satellite5 phenomenon7)
   added: (pointing satellite5 groundstation1)
   goals met: 0 of 8
2. (switch_on instrument13 satellite5)
   deleted: (power_avail satellite5)
   added: (power_on instrument13)
   goals met: 0 of 8
3. (calibrate satellite5 instrument13 groundstation1)
   added: (calibrated instrument13)
   goals met: 0 of 8
4. (turn_to satellite5 phenomenon6 groundstation1)
   deleted: (pointing satellite5 groundstation1)
   added: (pointing satellite5 phenomenon6)
   goals met: 0 of 8
5. (take_image satellite5 phenomenon6 instrument13 infrared4)
   added: (have_image phenomenon6 infrared4)
   goals met: 1 of 8
6. (turn_to satellite5 phenomenon5 phenomenon6)
   deleted: (pointing satellite5 phenomenon6)
   added: (pointing satellite5 phenomenon5)
   goals met: 1 of 8
7. (turn_to satellite3 groundstation1 star3)
   deleted: (pointing satellite3 star3)
   added: (pointing satellite3 groundstation1)
   goals met: 2 of 8
8. (turn_to satellite0 phenomenon5 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 phenomenon5)
   goals met: 3 of 8
9. (take_image satellite5 phenomenon5 instrument13 infrared4)
   added: (have_image phenomenon5 infrared4)
   goals met: 4 of 8
10. (turn_to satellite4 phenomenon6 groundstation2)
   deleted: (pointing satellite4 groundstation2)
   added: (pointing satellite4 phenomenon6)
   goals met: 5 of 8
11. (turn_to satellite5 phenomenon7 phenomenon5)
   deleted: (pointing satellite5 phenomenon5)
   added: (pointing satellite5 phenomenon7)
   goals met: 5 of 8
12. (take_image satellite5 phenomenon7 instrument13 infrared4)
   added: (have_image phenomenon7 infrared4)
   goals met: 6 of 8
13. (turn_to satellite5 phenomenon8 phenomenon7)
   deleted: (pointing satellite5 phenomenon7)
   added: (pointing satellite5 phenomenon8)
   goals met: 6 of 8
14. (take_image satellite5 phenomenon8 instrument13 image0)
   added: (have_image phenomenon8 image0)
   goals met: 7 of 8
15. (turn_to satellite5 planet9 phenomenon8)
   deleted: (pointing satellite5 phenomenon8)
   added: (pointing satellite5 planet9)
   goals met: 7 of 8
16. (take_image satellite5 planet9 instrument13 spectrograph3)
   added: (have_image planet9 spectrograph3)
   goals met: 8 of 8
